Tekla Open API Reference for Tekla Structures 2025
CustomLineType Operators
The CustomLineType type exposes the following members.
Operators
Name | Description
Equality
 Returns true if the current object and the given object are equal.
Inequality
 Returns true if the current object and the given object are not equal.
Top
See Also
Reference
CustomLineType Class
Tekla.Structures.Drawing Namespace